; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	infrared2 - mode
	spectrograph1 - mode
	image0 - mode
	Star0 - direction
	Star1 - direction
	Star9 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	Star3 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation7 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 infrared2)
	(have_image Star12 infrared2)
	(have_image Star13 infrared2)
	(have_image Star14 spectrograph1)
	(have_image Star15 spectrograph1)
	(have_image Planet16 image0)
))

)

; plan
1. (turn_to satellite1 groundstation6 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
3. (calibrate satellite1 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite1 planet16 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet16)
   goals met: 0 of 7
5. (take_image satellite1 planet16 instrument1 image0)
   added: (have_image planet16 image0)
   goals met: 1 of 7
6. (turn_to satellite1 planet11 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet11)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 7
8. (take_image satellite1 planet11 instrument1 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 2 of 7
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
10. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 2 of 7
11. (turn_to satellite0 phenomenon10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 7
12. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 7
13. (turn_to satellite0 star12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star12)
   goals met: 3 of 7
14. (take_image satellite0 star12 instrument0 infrared2)
   added: (have_image star12 infrared2)
   goals met: 4 of 7
15. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 4 of 7
16. (take_image satellite0 star13 instrument0 infrared2)
   added: (have_image star13 infrared2)
   goals met: 5 of 7
17. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 5 of 7
18. (take_image satellite0 star14 instrument0 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 6 of 7
19. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 6 of 7
20. (take_image satellite0 star15 instrument0 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 7 of 7
